John-Varghese-EH/ESP32CAM-ONVIF/ESP32CAM-ONVIF/web_config.cpp
#include "web_config.h"
#include <WebServer.h>
#include <WiFi.h>
#include "index_html.h" // Inline HTML
#include "rtsp_server.h"
#include "onvif_server.h"
#include "motion_detection.h"
#include "auto_flash.h"
#include "camera_control.h"
#include <FS.h>
#include <LittleFS.h>
#include <SD_MMC.h>
#include <ArduinoJson.h>
#include "esp_camera.h"
#include "wifi_manager.h"
#include "config.h"
#include <Update.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <esp_task_wdt.h>
#include "sd_recorder.h"
#include "mqtt_manager.h"
#include "webdav_server.h"
#ifdef BLUETOOTH_ENABLED
  #include "bluetooth_manager.h"
  #include "audio_manager.h"
#endif

// PTZ Servo support (if enabled)
#if PTZ_ENABLED
  #include <ESP32Servo.h>
  extern Servo servoPan;
  extern Servo servoTilt;
#endif

WebServer webConfigServer(WEB_PORT);

// Dedicated raw TCP server for MJPEG on port 81.
// This is SEPARATE from webConfigServer so the stream never blocks
// webConfigServer.handleClient(), allowing flash, config, and all
// API calls to work freely while the camera feed is active.
static WiFiServer s_streamServer(81);
static WiFiClient s_streamClient;
static volatile bool s_streamActive = false;

// Shared JSON response buffer (single-threaded, reused across API handlers)
// Eliminates heap fragmentation from String concatenation
static char s_jsonBuf[1024];

// === SECURITY: Rate limiting ===
#define MAX_AUTH_FAILURES 5
#define AUTH_LOCKOUT_MS   60000  // 60 second lockout
static int s_authFailures = 0;
static unsigned long s_lockoutStart = 0;

// === Performance: Heap low-water mark ===
static uint32_t s_minFreeHeap = UINT32_MAX;


// Add security headers to prevent XSS, clickjacking, MIME sniffing
static void addSecurityHeaders() {
    webConfigServer.sendHeader("X-Content-Type-Options", "nosniff");
    webConfigServer.sendHeader("X-Frame-Options", "SAMEORIGIN");
    webConfigServer.sendHeader("X-XSS-Protection", "1; mode=block");
    webConfigServer.sendHeader("Cache-Control", "no-store");
}

bool isAuthenticated(WebServer &server) {
    // Rate limiting: lockout after repeated failures
    if (s_authFailures >= MAX_AUTH_FAILURES) {
        if (millis() - s_lockoutStart < AUTH_LOCKOUT_MS) {
            server.send(429, "text/plain", "Too many attempts. Try again later.");
            return false;
        }
        s_authFailures = 0;  // Reset after lockout period
    }
    if (!server.authenticate(WEB_USER, WEB_PASS)) {
        s_authFailures++;
        if (s_authFailures >= MAX_AUTH_FAILURES) {
            s_lockoutStart = millis();
            Serial.println(F("[SECURITY] Auth lockout triggered"));
        }
        server.requestAuthentication();
        return false;
    }
    s_authFailures = 0;  // Reset on success
    addSecurityHeaders();
    return true;
}

void web_config_start() {
    // LittleFS no longer required for index.html, but still needed for SD/Config persistence if used
    if (!LittleFS.begin(true)) {
        Serial.println("[WARN] LittleFS Mount Failed - Configs might not save");
    }

    // Serving Embedded HTML
    webConfigServer.on("/", HTTP_GET, []() {
        if (!webConfigServer.authenticate(WEB_USER, WEB_PASS)) {
           return webConfigServer.requestAuthentication();
        }
        webConfigServer.sendHeader("Content-Encoding", "gzip");
        webConfigServer.send_P(200, "text/html", (const char*)index_html_gz, index_html_gz_len);
    });

    // --- API ENDPOINTS ---
    webConfigServer.on("/api/status", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        uint32_t freeHeap = ESP.getFreeHeap();
        uint32_t maxBlock = ESP.getMaxAllocHeap();
        snprintf(s_jsonBuf, sizeof(s_jsonBuf),
            "{\"status\":\"Online\","
            "\"rtsp\":\"%s\","
            "\"onvif\":\"http://%s:%d/onvif/device_service\","
            "\"onvif_enabled\":%s,"
            "\"motion\":%s,"
            "\"recording\":%s,"
            "\"sd_mounted\":%s,"
            "\"heap\":%u,"
            "\"max_block\":%u,"
            "\"min_heap\":%u,"
            "\"psram_free\":%u,"
            "\"uptime\":%lu,"
            "\"rssi\":%d,"
            "\"autoflash\":%s}",
            getRTSPUrl().c_str(),
            WiFi.localIP().toString().c_str(), ONVIF_PORT,
            onvif_is_enabled() ? "true" : "false",
            motion_detected() ? "true" : "false",
            sd_recorder_is_recording() ? "true" : "false",
            sd_recorder_is_mounted() ? "true" : "false",
            freeHeap,
            maxBlock,
            s_minFreeHeap,
            ESP.getFreePsram(),
            millis() / 1000,
            WiFi.RSSI(),
            auto_flash_is_enabled() ? "true" : "false");
        webConfigServer.send(200, "application/json", s_jsonBuf);
    });

    // --- Change Camera Settings ---
    webConfigServer.on("/api/config", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<256> doc;
        DeserializationError err = deserializeJson(doc, webConfigServer.arg("plain"));
        if (err) {
            webConfigServer.send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            return;
        }
        sensor_t * s = esp_camera_sensor_get();
        if (doc.containsKey("xclk")) {
            // To change xclk, you must re-init the camera. Not recommended at runtime.
            // Save to config and apply on reboot if needed.
        }
        if (doc.containsKey("resolution")) {
            String res = doc["resolution"].as<String>();
            if (res == "UXGA")      s->set_framesize(s, FRAMESIZE_UXGA);
            else if (res == "SXGA") s->set_framesize(s, FRAMESIZE_SXGA);
            else if (res == "XGA")  s->set_framesize(s, FRAMESIZE_XGA);
            else if (res == "SVGA") s->set_framesize(s, FRAMESIZE_SVGA);
            else if (res == "VGA")  s->set_framesize(s, FRAMESIZE_VGA);
            else if (res == "CIF")  s->set_framesize(s, FRAMESIZE_CIF);
            else if (res == "QVGA") s->set_framesize(s, FRAMESIZE_QVGA);
            else if (res == "QQVGA")s->set_framesize(s, FRAMESIZE_QQVGA);
        }
        if (doc.containsKey("quality"))     s->set_quality(s, doc["quality"]);
        if (doc.containsKey("brightness"))  s->set_brightness(s, doc["brightness"]);
        if (doc.containsKey("contrast"))    s->set_contrast(s, doc["contrast"]);
        if (doc.containsKey("saturation"))  s->set_saturation(s, doc["saturation"]);
        if (doc.containsKey("awb"))         s->set_whitebal(s, doc["awb"]);
        if (doc.containsKey("awb_gain"))    s->set_awb_gain(s, doc["awb_gain"]);
        if (doc.containsKey("wb_mode"))     s->set_wb_mode(s, doc["wb_mode"]);
        if (doc.containsKey("aec"))         s->set_aec2(s, doc["aec"]);
        if (doc.containsKey("aec2"))        s->set_aec2(s, doc["aec2"]);
        if (doc.containsKey("ae_level"))    s->set_ae_level(s, doc["ae_level"]);
        if (doc.containsKey("agc"))         s->set_gain_ctrl(s, doc["agc"]);
        if (doc.containsKey("gainceiling")) s->set_gainceiling(s, doc["gainceiling"]);
        if (doc.containsKey("bpc"))         s->set_bpc(s, doc["bpc"]);
        if (doc.containsKey("wpc"))         s->set_wpc(s, doc["wpc"]);
        if (doc.containsKey("raw_gma"))     s->set_raw_gma(s, doc["raw_gma"]);
        if (doc.containsKey("lenc"))        s->set_lenc(s, doc["lenc"]);
        if (doc.containsKey("hmirror"))     s->set_hmirror(s, doc["hmirror"]);
        if (doc.containsKey("vflip"))       s->set_vflip(s, doc["vflip"]);
        if (doc.containsKey("dcw"))         s->set_dcw(s, doc["dcw"]);
        webConfigServer.send(200, "application/json", "{\"ok\":1}");
    });

    // --- SD Card File List ---
    webConfigServer.on("/api/sd/list", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        String json = "[";
        File root = SD_MMC.open("/");
        File file = root.openNextFile();
        bool first = true;
        while(file){
            if (!first) json += ",";
            json += "\"" + String(file.name()) + "\"";
            file = root.openNextFile();
            first = false;
        }
        json += "]";
        webConfigServer.send(200, "application/json", json);
    });

