John-Varghese-EH/ESP32CAM-ONVIF/ESP32CAM-ONVIF/web_config.cpp
        webConfigServer.send(200, "application/json", "{\"ok\":1}");
    });
    
    // --- SD Card Information ---
    webConfigServer.on("/api/sd/info", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        uint64_t cardSize = SD_MMC.cardSize();
        uint64_t cardUsed = SD_MMC.usedBytes();
        uint64_t cardFree = cardSize - cardUsed;
        
        // Count files
        int fileCount = 0;
        File root = SD_MMC.open("/");
        File file = root.openNextFile();
        while(file) {
            if (!file.isDirectory()) fileCount++;
            file = root.openNextFile();
        }
        
        String json = "{";
        json += "\"total\":" + String((unsigned long)(cardSize / 1024)) + ",";
        json += "\"used\":" + String((unsigned long)(cardUsed / 1024)) + ",";
        json += "\"free\":" + String((unsigned long)(cardFree / 1024)) + ",";
        json += "\"file_count\":" + String(fileCount);
        json += "}";
        
        webConfigServer.send(200, "application/json", json);
    });
    
    // --- PTZ Control (if enabled) ---
    #if PTZ_ENABLED
    webConfigServer.on("/api/ptz/control", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<128> doc;
        deserializeJson(doc, webConfigServer.arg("plain"));
        
        if (doc.containsKey("action") && doc["action"] == "home") {
            servoPan.write(90);   // Center
            servoTilt.write(90);  // Center
        } else {
            if (doc.containsKey("pan")) {
                int angle = doc["pan"];
                angle = constrain(angle + 90, PTZ_PAN_MIN + 90, PTZ_PAN_MAX + 90);
                servoPan.write(angle);
            }
            if (doc.containsKey("tilt")) {
                int angle = doc["tilt"];
                angle = constrain(angle + 90, PTZ_TILT_MIN + 90, PTZ_TILT_MAX + 90);
                servoTilt.write(angle);
            }
        }
        
        webConfigServer.send(200, "application/json", "{\"ok\":1}");
    });
    #endif
    
    // --- Settings Export ---
    webConfigServer.on("/api/settings/export", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        sensor_t * s = esp_camera_sensor_get();
        
        String json = "{";
        json += "\"version\":\"1.0\",";
        json += "\"camera\":{";
        json += "\"framesize\":" + String(s->status.framesize) + ",";
        json += "\"quality\":" + String(s->status.quality) + ",";
        json += "\"brightness\":" + String(s->status.brightness) + ",";
        json += "\"contrast\":" + String(s->status.contrast) + ",";
        json += "\"saturation\":" + String(s->status.saturation) + ",";
        json += "\"awb\":" + String(s->status.awb) + ",";
        json += "\"aec\":" + String(s->status.aec2) + ",";
        json += "\"ae_level\":" + String(s->status.ae_level) + ",";
        json += "\"agc\":" + String(s->status.agc) + ",";
        json += "\"gainceiling\":" + String(s->status.gainceiling) + ",";
        json += "\"hmirror\":" + String(s->status.hmirror) + ",";
        json += "\"vflip\":" + String(s->status.vflip);
        json += "},";
        json += "\"autoflash\":" + String(auto_flash_is_enabled() ? "true" : "false") + ",";
        json += "\"onvif\":" + String(onvif_is_enabled() ? "true" : "false");
        
        #ifdef BLUETOOTH_ENABLED
        json += ",\"bluetooth\":{";
        json += "\"enabled\":" + String(appSettings.btEnabled ? "true" : "false") + ",";
        json += "\"stealth\":" + String(appSettings.btStealthMode ? "true" : "false") + ",";
        json += "\"mac\":\"" + String(appSettings.btPresenceMac) + "\",";
        json += "\"timeout\":" + String(appSettings.btPresenceTimeout) + ",";
        json += "\"gain\":" + String(appSettings.btMicGain) + ",";
        json += "\"audioSource\":" + String(appSettings.audioSource);
        json += "}";
        #endif
        
        json += "}";
        
        webConfigServer.sendHeader("Content-Disposition", "attachment; filename=esp32cam-config.json");
        webConfigServer.send(200, "application/json", json);
    });
    
    // --- Settings Import ---
    webConfigServer.on("/api/settings/import", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        StaticJsonDocument<1024> doc;
        DeserializationError err = deserializeJson(doc, webConfigServer.arg("plain"));
        
        if (err) {
            webConfigServer.send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            return;
        }
        
        sensor_t * s = esp_camera_sensor_get();
        
        // Apply camera settings
        if (doc.containsKey("camera")) {
            JsonObject cam = doc["camera"];
            if (cam.containsKey("framesize")) s->set_framesize(s, (framesize_t)cam["framesize"].as<int>());
            if (cam.containsKey("quality")) s->set_quality(s, cam["quality"]);
            if (cam.containsKey("brightness")) s->set_brightness(s, cam["brightness"]);
            if (cam.containsKey("contrast")) s->set_contrast(s, cam["contrast"]);
            if (cam.containsKey("saturation")) s->set_saturation(s, cam["saturation"]);
            if (cam.containsKey("awb")) s->set_whitebal(s, cam["awb"]);
            if (cam.containsKey("aec")) s->set_aec2(s, cam["aec"]);
            if (cam.containsKey("ae_level")) s->set_ae_level(s, cam["ae_level"]);
            if (cam.containsKey("agc")) s->set_gain_ctrl(s, cam["agc"]);
            if (cam.containsKey("gainceiling")) s->set_gainceiling(s, (gainceiling_t)cam["gainceiling"].as<int>());
            if (cam.containsKey("hmirror")) s->set_hmirror(s, cam["hmirror"]);
            if (cam.containsKey("vflip")) s->set_vflip(s, cam["vflip"]);
        }
        
        // Apply other settings
        if (doc.containsKey("autoflash")) {
            auto_flash_set_enabled(doc["autoflash"]);
        }
        if (doc.containsKey("onvif")) {
            onvif_set_enabled(doc["onvif"]);
        }
        
        #ifdef BLUETOOTH_ENABLED
        if (doc.containsKey("bluetooth")) {
            JsonObject bt = doc["bluetooth"];
            if (bt.containsKey("enabled")) appSettings.btEnabled = bt["enabled"];
            if (bt.containsKey("stealth")) appSettings.btStealthMode = bt["stealth"];
            if (bt.containsKey("mac")) strncpy(appSettings.btPresenceMac, bt["mac"] | "", sizeof(appSettings.btPresenceMac) - 1);
            if (bt.containsKey("timeout")) appSettings.btPresenceTimeout = bt["timeout"];
            if (bt.containsKey("gain")) appSettings.btMicGain = bt["gain"];
            if (bt.containsKey("audioSource")) appSettings.audioSource = (AudioSource)bt["audioSource"].as<int>();
            saveSettings();
        }
        #endif
        
