John-Varghese-EH/ESP32CAM-ONVIF/ESP32CAM-ONVIF/web_config.cpp
        json += "]}";
        webConfigServer.send(200, "application/json", json);
    });
    
    // --- Clear Events ---
    webConfigServer.on("/api/events", HTTP_DELETE, []() {
        if (!isAuthenticated(webConfigServer)) return;
        eventCount = 0;
        eventIndex = 0;
        webConfigServer.send(200, "application/json", "{\"ok\":1}");
    });
    
    // Log system boot event
    addEvent("boot", "System started");

    // ==================== VIDEO RECORDINGS ====================
    // --- List Recordings ---
    webConfigServer.on("/api/recordings", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        String json = "{\"recordings\":[";
        File root = SD_MMC.open("/");
        File file = root.openNextFile();
        bool first = true;
        
        while(file) {
            if (!file.isDirectory()) {
                String fname = String(file.name());
                if (fname.endsWith(".avi") || fname.endsWith(".mp4") || fname.endsWith(".mjpeg")) {
                    if (!first) json += ",";
                    json += "{";
                    json += "\"name\":\"" + fname + "\",";
                    json += "\"size\":" + String(file.size()) + ",";
                    json += "\"time\":" + String(file.getLastWrite());
                    json += "}";
                    first = false;
                }
            }
            file = root.openNextFile();
        }
        
        json += "]}";
        webConfigServer.send(200, "application/json", json);
    });
    
    // --- Stream Recording ---
    webConfigServer.on("/api/recordings/stream", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        if (!webConfigServer.hasArg("file")) {
            webConfigServer.send(400, "text/plain", "Missing file param");
            return;
        }
        
        String filename = "/" + webConfigServer.arg("file");
        File file = SD_MMC.open(filename, "r");
        
        if (!file) {
            webConfigServer.send(404, "text/plain", "File not found");
            return;
        }
        
        String contentType = "video/mpeg";
        if (filename.endsWith(".mp4")) contentType = "video/mp4";
        else if (filename.endsWith(".mjpeg")) contentType = "video/x-motion-jpeg";
        
        webConfigServer.streamFile(file, contentType);
        file.close();
    });
    
    // --- Delete Recording ---
    webConfigServer.on("/api/recordings/delete", HTTP_DELETE, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        StaticJsonDocument<128> doc;
        deserializeJson(doc, webConfigServer.arg("plain"));
        String filename = "/" + doc["file"].as<String>();
        
        if (SD_MMC.remove(filename)) {
            webConfigServer.send(200, "application/json", "{\"ok\":1}");
        } else {
            webConfigServer.send(404, "application/json", "{\"error\":\"Delete failed\"}");
        }
    });

    // ==================== NETWORK DIAGNOSTICS ====================
    // --- Ping Test ---
    webConfigServer.on("/api/network/ping", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        snprintf(s_jsonBuf, sizeof(s_jsonBuf),
            "{\"timestamp\":%lu,\"rssi\":%d,\"ip\":\"%s\"}",
            millis(), WiFi.RSSI(), WiFi.localIP().toString().c_str());
        webConfigServer.send(200, "application/json", s_jsonBuf);
    });
    
    // --- Bandwidth Test ---
    webConfigServer.on("/api/network/bandwidth-test", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        size_t dataSize = webConfigServer.arg("plain").length();
        unsigned long timestamp = millis();
        
        String json = "{";
        json += "\"bytes_received\":" + String(dataSize) + ",";
        json += "\"timestamp\":" + String(timestamp);
        json += "}";
        
        webConfigServer.send(200, "application/json", json);
    });

    // --- Time Sync API ---
    webConfigServer.on("/api/time", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<64> doc;
        deserializeJson(doc, webConfigServer.arg("plain"));
        long epoch = doc["epoch"];
        if(epoch > 0) {
            struct timeval tv;
            tv.tv_sec = epoch;
            tv.tv_usec = 0;
            settimeofday(&tv, NULL); 
            Serial.println("[INFO] Time set via Web");
            webConfigServer.send(200, "application/json", "{\"ok\":1}");
        } else {
             webConfigServer.send(400, "application/json", "{\"error\":\"Invalid time\"}");
        }
    });
    // --- WiFi API Endpoints ---
    webConfigServer.on("/api/wifi/status", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        snprintf(s_jsonBuf, sizeof(s_jsonBuf),
            "{\"connected\":%s,\"ssid\":\"%s\",\"ip\":\"%s\",\"mode\":\"%s\"}",
            WiFi.status() == WL_CONNECTED ? "true" : "false",
            wifiManager.getSSID().c_str(),
            wifiManager.getLocalIP().toString().c_str(),
            wifiManager.isInAPMode() ? "AP" : "STA");
        webConfigServer.send(200, "application/json", s_jsonBuf);
    });
    
    webConfigServer.on("/api/wifi/scan", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        int networksFound = wifiManager.scanNetworks();
        WiFiNetwork* networks = wifiManager.getScannedNetworks();
        
        String json = "{\"networks\":[";
        for (int i = 0; i < networksFound; i++) {
            if (i > 0) json += ",";
            json += "{";
            json += "\"ssid\":\"" + String(networks[i].ssid) + "\",";
            json += "\"rssi\":" + String(networks[i].rssi) + ",";
            json += "\"encType\":" + String(networks[i].encType);
            json += "}";
        }
        json += "]}";
        
        webConfigServer.send(200, "application/json", json);
    });
    
    webConfigServer.on("/api/wifi/connect", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
