John-Varghese-EH/ESP32CAM-ONVIF/ESP32CAM-ONVIF/web_config.cpp
        StaticJsonDocument<256> doc;
        DeserializationError err = deserializeJson(doc, webConfigServer.arg("plain"));
        
        if (err || !doc.containsKey("ssid") || !doc.containsKey("password")) {
            webConfigServer.send(400, "application/json", "{\"success\":false,\"message\":\"Invalid request\"}");
            return;
        }
        
        String ssid = doc["ssid"].as<String>();
        String password = doc["password"].as<String>();
        
        // Save credentials
        if (wifiManager.saveCredentials(ssid, password)) {
            // Try to connect
            bool connected = wifiManager.connectToNetwork(ssid, password);
            
            if (connected) {
                webConfigServer.send(200, "application/json", "{\"success\":true,\"message\":\"Connected\"}");
                
                // Optional: schedule a restart after a short delay to ensure response is sent
                delay(1000);
                ESP.restart();
            } else {
                webConfigServer.send(200, "application/json", "{\"success\":false,\"message\":\"Failed to connect\"}");
            }
        } else {
            webConfigServer.send(500, "application/json", "{\"success\":false,\"message\":\"Failed to save credentials\"}");
        }
    });

    // === STREAM ENDPOINT (port 80) ===
    // The MJPEG stream runs on a DEDICATED raw TCP server (port 81) via
    // web_config_stream_loop().  This route on port 80 just redirects the
    // browser there so webConfigServer.handleClient() is NEVER blocked.
    webConfigServer.on("/stream", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        // Redirect to the dedicated stream port
        String host = webConfigServer.hostHeader();
        // Replace port in host if present, otherwise append :81
        int colonIdx = host.lastIndexOf(':');
        if (colonIdx > 0) host = host.substring(0, colonIdx);
        String location = "http://" + host + ":81/";
        webConfigServer.sendHeader("Location", location, true);
        webConfigServer.send(302, "text/plain", "Stream is on port 81");
    });


    // --- Snapshot endpoint ---
    webConfigServer.on("/snapshot", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        camera_fb_t *fb = esp_camera_fb_get();
        if (!fb) {
            webConfigServer.send(500, "text/plain", "Camera Error");
            return;
        }
        webConfigServer.sendHeader("Content-Type", "image/jpeg");
        webConfigServer.send_P(200, "image/jpeg", (char*)fb->buf, fb->len);
        esp_camera_fb_return(fb);
    });

    // --- Bluetooth Endpoints ---
    #ifdef BLUETOOTH_ENABLED
    webConfigServer.on("/api/bt/status", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        String json = "{";
        json += "\"enabled\":" + String(appSettings.btEnabled ? "true" : "false") + ",";
        json += "\"stealth\":" + String(appSettings.btStealthMode ? "true" : "false") + ",";
        json += "\"mac\":\"" + String(appSettings.btPresenceMac) + "\",";
        json += "\"userPresent\":" + String(btManager.isUserPresent() ? "true" : "false") + ",";
        json += "\"audioSource\":" + String(appSettings.audioSource) + ",";
        json += "\"gain\":" + String(appSettings.btMicGain) + ",";
        json += "\"timeout\":" + String(appSettings.btPresenceTimeout);
        json += "}";
        webConfigServer.send(200, "application/json", json);
    });

    webConfigServer.on("/api/bt/config", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<256> doc;
        DeserializationError err = deserializeJson(doc, webConfigServer.arg("plain"));
        if (err) {
            webConfigServer.send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            return;
        }
        
        if(doc.containsKey("enabled")) appSettings.btEnabled = doc["enabled"];
        if(doc.containsKey("stealth")) appSettings.btStealthMode = doc["stealth"];
        if(doc.containsKey("mac")) strncpy(appSettings.btPresenceMac, doc["mac"] | "", sizeof(appSettings.btPresenceMac) - 1);
        if(doc.containsKey("gain")) appSettings.btMicGain = doc["gain"];
        if(doc.containsKey("timeout")) appSettings.btPresenceTimeout = doc["timeout"];
        if(doc.containsKey("audioSource")) {
             int src = doc["audioSource"];
             appSettings.audioSource = (AudioSource)src;
             audioManager.begin(); // Re-init audio with new source
        }
        
        saveSettings();
        
        // If enabling BT, start it
        if (appSettings.btEnabled) btManager.begin();
        
        webConfigServer.send(200, "application/json", "{\"ok\":1}");
    });

    webConfigServer.on("/api/bt/scan", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        // Trigger scan if not enabled?
        // Return latest cache
        webConfigServer.send(200, "application/json", btManager.getLastScanResult());
    });
    #endif // BLUETOOTH_ENABLED
    
    // === OTA Backend State & Preparation ===
    static volatile int ota_progress = -1;
    static String ota_status_msg = "";
    static String ota_status_detail = "";

    auto prepare_for_ota = []() {
        Serial.println("[OTA] Preparing for OTA: Stopping services to free memory...");
        sd_recorder_stop_manual();
        // Stop camera to free massive framebuffers back to PSRAM/Heap
        esp_camera_deinit();
        delay(500); 
    };

    // === GitHub Background OTA Task ===
    auto otaGithubTask = [](void *pvParameters) {
        String url = String((char *)pvParameters);
        free(pvParameters);
        
        ota_progress = 0;
        ota_status_msg = "Connecting to GitHub...";
        
        WiFiClientSecure client;
        client.setInsecure();
        HTTPClient https;
        https.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
        https.setTimeout(30000); 
        
        if (https.begin(client, url)) {
            int httpCode = https.GET();
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
                int contentLength = https.getSize();
                if (contentLength <= 0) {
                    ota_status_msg = "Invalid content length";
                    ota_progress = -2;
                    https.end();
                    vTaskDelete(NULL);
                    return;
                }
                
                if (Update.begin(contentLength, U_FLASH)) {
                    ota_status_msg = "Downloading firmware...";
                    WiFiClient *stream = https.getStreamPtr();
                    
