John-Varghese-EH/ESP32CAM-ONVIF/ESP32CAM-ONVIF/web_config.cpp
                    uint8_t buff[1024];
                    size_t written = 0;
                    unsigned long lastDataTime = millis();
                    
                    while (https.connected() && written < contentLength) {
                        size_t available = stream->available();
                        if (available) {
                            int c = stream->readBytes(buff, ((available > sizeof(buff)) ? sizeof(buff) : available));
                            Update.write(buff, c);
                            written += c;
                            
                            ota_progress = (written * 100) / contentLength;
                            lastDataTime = millis();
                            
                            esp_task_wdt_reset();
                            yield();
                        } else {
                            if (millis() - lastDataTime > 15000) {
                                ota_status_msg = "Download timeout";
                                ota_progress = -2;
                                break;
                            }
                            delay(10);
                        }
                    }
                    
                    if (written == contentLength) {
                        if (Update.end(true)) {
                            ota_progress = 100;
                            ota_status_msg = "Update Complete. Rebooting...";
                            delay(1000);
                            ESP.restart();
                        } else {
                            ota_status_msg = "Update failed on end()";
                            ota_progress = -2;
                        }
                    } else {
                        ota_status_msg = "Download incomplete";
                        ota_progress = -2;
                        Update.abort();
                    }
                } else {
                    ota_status_msg = "Not enough space for OTA";
                    ota_progress = -2;
                }
            } else {
                ota_status_msg = "Failed to download (HTTP " + String(httpCode) + ")";
                ota_progress = -2;
            }
            https.end();
        } else {
            ota_status_msg = "Unable to connect to GitHub";
            ota_progress = -2;
        }
        
        vTaskDelete(NULL);
    };

    // === OTA Firmware Update (with authentication) ===
    webConfigServer.on("/api/update", HTTP_POST, []() {
        // Response handler: called after upload completes
        if (!isAuthenticated(webConfigServer)) return;
        if (Update.hasError()) {
            webConfigServer.send(500, "application/json", "{\"error\":\"Update failed\"}");
        } else {
            webConfigServer.send(200, "application/json", "{\"success\":true,\"message\":\"Update complete. Rebooting...\"}");
            delay(1000);
            ESP.restart();
        }
    }, [prepare_for_ota]() {
        // Upload handler: processes firmware data chunks
        if (!webConfigServer.authenticate(WEB_USER, WEB_PASS)) {
            return;
        }
        HTTPUpload& upload = webConfigServer.upload();
        if (upload.status == UPLOAD_FILE_START) {
            Serial.printf("[OTA] Update: %s\n", upload.filename.c_str());
            prepare_for_ota();
            if (!Update.begin(UPDATE_SIZE_UNKNOWN, U_FLASH)) {
                Update.printError(Serial);
            }
        } else if (upload.status == UPLOAD_FILE_WRITE) {
            if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
                Update.printError(Serial);
            }
        } else if (upload.status == UPLOAD_FILE_END) {
            if (Update.end(true)) {
                Serial.printf("[OTA] Success: %u bytes\n", upload.totalSize);
            } else {
                Update.printError(Serial);
            }
        }
    });

    // === GitHub OTA Check ===
    webConfigServer.on("/api/update/check", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;

        // Only attempt if connected to the internet (not AP-only mode)
        if (WiFi.status() != WL_CONNECTED) {
            snprintf(s_jsonBuf, sizeof(s_jsonBuf),
                "{\"current_version\":\"%s\",\"latest_version\":\"\","
                "\"download_url\":\"\",\"offline\":true,"
                "\"error\":\"Not connected to internet\"}",
                FIRMWARE_VERSION);
            webConfigServer.send(200, "application/json", s_jsonBuf);
            return;
        }

        WiFiClientSecure client;
        client.setInsecure();
        client.setTimeout(8); // 8-second timeout — don't hang the UI

        HTTPClient https;
        https.setTimeout(8000);

        String url = String("https://api.github.com/repos/")
                     + GITHUB_REPO_OWNER + "/" + GITHUB_REPO_NAME + "/releases/latest";

        if (!https.begin(client, url)) {
            snprintf(s_jsonBuf, sizeof(s_jsonBuf),
                "{\"current_version\":\"%s\",\"latest_version\":\"\","
                "\"download_url\":\"\",\"offline\":true,"
                "\"error\":\"Unable to connect to GitHub API\"}",
                FIRMWARE_VERSION);
            webConfigServer.send(200, "application/json", s_jsonBuf);
            return;
        }

        int httpCode = https.GET();

        if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
            String payload = https.getString();
            https.end();

            DynamicJsonDocument doc(4096);
            DeserializationError error = deserializeJson(doc, payload);

            if (!error) {
                String tagName    = doc["tag_name"] | "";
                String downloadUrl = "";
                JsonArray assets = doc["assets"];
                for (JsonObject asset : assets) {
                    String name = asset["name"] | "";
                    if (name.endsWith(".bin")) {
                        downloadUrl = asset["browser_download_url"] | "";
                        break;
                    }
                }
                snprintf(s_jsonBuf, sizeof(s_jsonBuf),
                    "{\"current_version\":\"%s\",\"latest_version\":\"%s\","
                    "\"download_url\":\"%s\",\"offline\":false}",
                    FIRMWARE_VERSION, tagName.c_str(), downloadUrl.c_str());
                webConfigServer.send(200, "application/json", s_jsonBuf);
            } else {
                webConfigServer.send(200, "application/json",
                    "{\"error\":\"Failed to parse GitHub response\",\"offline\":false}");
            }
        } else {
            https.end();
            snprintf(s_jsonBuf, sizeof(s_jsonBuf),
                "{\"current_version\":\"%s\",\"latest_version\":\"\","
                "\"download_url\":\"\",\"offline\":true,"
                "\"error\":\"GitHub returned HTTP %d\"}",
                FIRMWARE_VERSION, httpCode);
            webConfigServer.send(200, "application/json", s_jsonBuf);
        }
    });


    // === GitHub OTA Download & Install (Async) ===
    webConfigServer.on("/api/update/github", HTTP_POST, [prepare_for_ota, otaGithubTask]() {
        if (!isAuthenticated(webConfigServer)) return;
        
