John-Varghese-EH/ESP32CAM-ONVIF/ESP32CAM-ONVIF/web_config.cpp
        if (ota_progress >= 0 && ota_progress < 100) {
            webConfigServer.send(400, "application/json", "{\"error\":\"Update already in progress\"}");
            return;
        }

        StaticJsonDocument<512> doc;
        DeserializationError err = deserializeJson(doc, webConfigServer.arg("plain"));
        
        if (err || !doc.containsKey("url")) {
            webConfigServer.send(400, "application/json", "{\"error\":\"Missing download URL\"}");
            return;
        }
        
        String url = doc["url"].as<String>();
        
        prepare_for_ota();
        
        // Allocate URL string on heap for the task
        char *urlStr = (char *)malloc(url.length() + 1);
        strcpy(urlStr, url.c_str());
        
        xTaskCreate(otaGithubTask, "otaTask", 8192, (void *)urlStr, 1, NULL);
        
        webConfigServer.send(200, "application/json", "{\"success\":true, \"message\":\"Downloading firmware in background\"}");
    });

    // === OTA Status Polling ===
    webConfigServer.on("/api/update/status", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        
        String response = "{";
        response += "\"progress\":" + String(ota_progress) + ",";
        response += "\"message\":\"" + ota_status_msg + "\"";
        response += "}";
        
        webConfigServer.send(200, "application/json", response);
    });


    // === Integration Settings (MQTT + Telegram) ===
    webConfigServer.on("/api/settings", HTTP_GET, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<1024> doc;
        doc["btEnabled"] = appSettings.btEnabled;
        doc["btStealth"] = appSettings.btStealthMode;
        doc["btMac"]     = appSettings.btPresenceMac;
        doc["btTimeout"] = appSettings.btPresenceTimeout;
        doc["btGain"]    = appSettings.btMicGain;
        doc["hwGain"]    = appSettings.hwMicGain;
        doc["audioSrc"]  = (int)appSettings.audioSource;
        
        doc["mqttEnabled"] = appSettings.mqttEnabled;
        doc["mqttBroker"] = appSettings.mqttBroker;
        doc["mqttPort"] = appSettings.mqttPort;
        doc["mqttUser"] = appSettings.mqttUser;
        doc["mqttPass"] = appSettings.mqttPassword;
        
        doc["tgEnabled"] = appSettings.telegramEnabled;
        doc["tgToken"] = appSettings.telegramBotToken;
        doc["tgChatId"] = appSettings.telegramChatId;
        
        doc["gdEnabled"] = appSettings.googleDriveEnabled;
        doc["gdMotion"] = appSettings.googleDriveMotion;
        doc["gdUrl"] = appSettings.googleDriveScriptUrl;
        
        doc["webDav"] = appSettings.webDavEnabled;
        doc["contRec"] = appSettings.continuousRecordingEnabled;
        doc["contRecChunk"] = appSettings.continuousRecordingChunkSize;
        doc["ntp"] = appSettings.ntpServer;
        doc["tz"] = appSettings.timeZone;

        String response;
        serializeJson(doc, response);
        webConfigServer.send(200, "application/json", response);
    });

    webConfigServer.on("/api/settings", HTTP_POST, []() {
        if (!isAuthenticated(webConfigServer)) return;
        StaticJsonDocument<1024> doc;
        DeserializationError err = deserializeJson(doc, webConfigServer.arg("plain"));
        if (err) {
            webConfigServer.send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            return;
        }

        if(doc.containsKey("btEnabled")) appSettings.btEnabled = doc["btEnabled"];
        if(doc.containsKey("btStealth")) appSettings.btStealthMode = doc["btStealth"];
        if(doc.containsKey("btMac"))     strncpy(appSettings.btPresenceMac, doc["btMac"], sizeof(appSettings.btPresenceMac) - 1);
        if(doc.containsKey("btTimeout")) appSettings.btPresenceTimeout = doc["btTimeout"];
        if(doc.containsKey("btGain"))    appSettings.btMicGain = doc["btGain"];
        if(doc.containsKey("hwGain"))    appSettings.hwMicGain = doc["hwGain"];
        if(doc.containsKey("audioSrc"))  appSettings.audioSource = (AudioSource)doc["audioSrc"].as<int>();

        if(doc.containsKey("mqttEnabled")) appSettings.mqttEnabled = doc["mqttEnabled"];
        if(doc.containsKey("mqttBroker")) strncpy(appSettings.mqttBroker, doc["mqttBroker"], sizeof(appSettings.mqttBroker) - 1);
        if(doc.containsKey("mqttPort")) appSettings.mqttPort = doc["mqttPort"];
        if(doc.containsKey("mqttUser")) strncpy(appSettings.mqttUser, doc["mqttUser"], sizeof(appSettings.mqttUser) - 1);
        if(doc.containsKey("mqttPass")) strncpy(appSettings.mqttPassword, doc["mqttPass"], sizeof(appSettings.mqttPassword) - 1);

        if(doc.containsKey("tgEnabled")) appSettings.telegramEnabled = doc["tgEnabled"];
        if(doc.containsKey("tgToken")) strncpy(appSettings.telegramBotToken, doc["tgToken"], sizeof(appSettings.telegramBotToken) - 1);
        if(doc.containsKey("tgChatId")) strncpy(appSettings.telegramChatId, doc["tgChatId"], sizeof(appSettings.telegramChatId) - 1);

        if(doc.containsKey("gdEnabled")) appSettings.googleDriveEnabled = doc["gdEnabled"];
        if(doc.containsKey("gdMotion")) appSettings.googleDriveMotion = doc["gdMotion"];
        if(doc.containsKey("gdUrl")) strncpy(appSettings.googleDriveScriptUrl, doc["gdUrl"], sizeof(appSettings.googleDriveScriptUrl) - 1);

        if(doc.containsKey("webDav")) appSettings.webDavEnabled = doc["webDav"];
        if(doc.containsKey("contRec")) appSettings.continuousRecordingEnabled = doc["contRec"];
        if(doc.containsKey("contRecChunk")) appSettings.continuousRecordingChunkSize = doc["contRecChunk"];
        if(doc.containsKey("ntp")) strncpy(appSettings.ntpServer, doc["ntp"], sizeof(appSettings.ntpServer) - 1);
        if(doc.containsKey("tz")) strncpy(appSettings.timeZone, doc["tz"], sizeof(appSettings.timeZone) - 1);

        saveSettings();
        webConfigServer.send(200, "application/json", "{\"success\":true,\"message\":\"Settings Saved\"}");
    });

    // --- WebDAV Integration ---
    const char * headerkeys[] = {"Depth"};
    size_t headerkeyssize = sizeof(headerkeys) / sizeof(char*);
    webConfigServer.collectHeaders(headerkeys, headerkeyssize);
    webdav_server_init(&webConfigServer);

    webConfigServer.begin();
    s_streamServer.begin();
    Serial.println("[INFO] Web config server started on port 80, stream server on port 81.");
    }



void web_config_loop() {
    webConfigServer.handleClient();

    // Track heap low-water mark for fragmentation monitoring
    uint32_t freeHeap = ESP.getFreeHeap();
    if (freeHeap < s_minFreeHeap) {
        s_minFreeHeap = freeHeap;
    }
}

// ---------------------------------------------------------------------------
// web_config_stream_loop() - call from the main Arduino loop().
// Accepts new clients on port 81 and streams MJPEG until they disconnect.
// Because this runs in the same loop() as web_config_loop(), both are
// non-blocking: web_config_loop() serves API requests while
// web_config_stream_loop() pumps frames to the active stream client.
// ---------------------------------------------------------------------------
void web_config_stream_loop() {
    // Accept a new client if none is active
    if (!s_streamActive) {
        WiFiClient newClient = s_streamServer.accept();
        if (newClient) {
            // Read and discard the HTTP request headers
            unsigned long t = millis();
            while (newClient.connected() && millis() - t < 1000) {
                if (newClient.available()) {
                    String line = newClient.readStringUntil('\n');
                    if (line == "\r") break; // blank line = end of headers
                }
            }
            // Send MJPEG response headers
            newClient.print(
                "HTTP/1.1 200 OK\r\n"
                "Content-Type: multipart/x-mixed-replace; boundary=frame\r\n"
                "Cache-Control: no-cache\r\n"
                "Access-Control-Allow-Origin: *\r\n"
                "Connection: close\r\n"
                "\r\n"
            );
            newClient.setTimeout(2);
            s_streamClient = newClient;
            s_streamActive = true;
            Serial.println("[INFO] MJPEG Stream client connected on port 81");
        }
        return; // nothing to stream yet
    }

    // Disconnect check
    if (!s_streamClient.connected()) {
        Serial.println("[INFO] MJPEG Stream client disconnected");
        s_streamClient.stop();
        s_streamActive = false;
        return;
    }

    // Rate-limit to ~10 FPS
    static int64_t s_lastFrame = 0;
    int64_t now = esp_timer_get_time() / 1000;
    if (now - s_lastFrame < 100) return;
    s_lastFrame = now;

    esp_task_wdt_reset();

    camera_fb_t *fb = esp_camera_fb_get();
    if (!fb) return;

    size_t dataLen = fb->len;
    s_streamClient.printf(
        "--frame\r\n"
        "Content-Type: image/jpeg\r\n"
        "Content-Length: %u\r\n\r\n",
        dataLen
    );

    const size_t chunkSize = 2048;
    size_t wlen = 0;
    for (size_t i = 0; i < dataLen; i += chunkSize) {
        size_t toWrite = (dataLen - i < chunkSize) ? (dataLen - i) : chunkSize;
        size_t written = s_streamClient.write(fb->buf + i, toWrite);
        if (written != toWrite) { wlen = 0; break; }
        wlen += written;
    }
    s_streamClient.print("\r\n");
    esp_camera_fb_return(fb);

    if (wlen != dataLen) {
        Serial.println("[WARN] Stream write incomplete — client dropped");
        s_streamClient.stop();
        s_streamActive = false;
    }
}